[
  {
    "user_message": "Xin chào, bạn khỏe không?",
    "context": "",
    "expected_response": "Xin chào! Tôi khỏe, cảm ơn bạn đã hỏi. Bạn thì sao?",
    "reward": 0.8
  },
  {
    "user_message": "Bạn có thể giúp tôi học tiếng Anh không?",
    "context": "Người dùng muốn học ngôn ngữ",
    "expected_response": "Tất nhiên! Tôi rất sẵn lòng giúp bạn học tiếng Anh. Bạn muốn bắt đầu từ phần nào?",
    "reward": 0.9
  },
  {
    "user_message": "Hôm nay thời tiết thế nào?",
    "context": "",
    "expected_response": "Tôi không thể kiểm tra thời tiết thời gian thực, nhưng bạn có thể xem dự báo thời tiết trên các ứng dụng hoặc website chuyên dụng.",
    "reward": 0.6
  },
  {
    "user_message": "Tôi cảm thấy buồn",
    "context": "Người dùng đang có cảm xúc tiêu cực",
    "expected_response": "Tôi hiểu bạn đang cảm thấy buồn. Bạn có muốn chia sẻ điều gì đang làm bạn khó chịu không? Tôi sẵn sàng lắng nghe.",
    "reward": 0.9
  },
  {
    "user_message": "Làm thế nào để nấu phở?",
    "context": "Người dùng muốn học nấu ăn",
    "expected_response": "Để nấu phở, bạn cần chuẩn bị nước dùng từ xương bò, bánh phở, thịt bò thái mỏng, và các gia vị như hành tây, gừng, quế, hồi. Bạn có muốn tôi hướng dẫn chi tiết từng bước không?",
    "reward": 0.8
  },
  {
    "user_message": "Bạn có biết về trí tuệ nhân tạo không?",
    "context": "",
    "expected_response": "Có, tôi có kiến thức về trí tuệ nhân tạo. AI là công nghệ mô phỏng trí thông minh con người trong máy tính. Bạn muốn tìm hiểu về khía cạnh nào của AI?",
    "reward": 0.7
  },
  {
    "user_message": "Tôi muốn học lập trình Python",
    "context": "Người dùng muốn học lập trình",
    "expected_response": "Python là ngôn ngữ lập trình tuyệt vời để bắt đầu! Bạn đã có kinh nghiệm lập trình nào chưa? Tôi có thể gợi ý lộ trình học phù hợp.",
    "reward": 0.8
  },
  {
    "user_message": "Cảm ơn bạn đã giúp đỡ",
    "context": "",
    "expected_response": "Không có gì! Tôi rất vui khi có thể giúp đỡ bạn. Nếu có thắc mắc gì khác, đừng ngại hỏi nhé!",
    "reward": 0.9
  },
  {
    "user_message": "Bạn có thể kể một câu chuyện vui không?",
    "context": "Người dùng muốn giải trí",
    "expected_response": "Tất nhiên! Có một lần, một con gà đi qua đường. Tại sao? Để chứng minh cho gà khác thấy rằng điều đó có thể làm được! Bạn có muốn nghe thêm câu chuyện khác không?",
    "reward": 0.6
  },
  {
    "user_message": "Tôi cần lời khuyên về công việc",
    "context": "Người dùng cần tư vấn nghề nghiệp",
    "expected_response": "Tôi sẵn sàng chia sẻ lời khuyên về công việc. Bạn đang gặp khó khăn gì cụ thể? Có phải về việc tìm việc, thăng tiến, hay mối quan hệ đồng nghiệp?",
    "reward": 0.8
  }
]
